YuzhuoLiuRTK/zephyr/drivers/can/can_rtl87x2g.c
/*
 * Copyright(c) 2020, Realtek Semiconductor Corporation.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT realtek_rtl87x2g_can

#include <zephyr/drivers/can/transceiver.h>
#include <zephyr/drivers/clock_control/rtl87x2g_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/sys/util.h>
#include <string.h>
#include <zephyr/kernel.h>
#include <soc.h>
#include <errno.h>
#include <stdbool.h>
#include <zephyr/drivers/can.h>
#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

#include <rtl_can.h>

#include <trace.h>
#define DBG_DIRECT_SHOW 0

LOG_MODULE_REGISTER(can_rtl87x2g, CONFIG_CAN_LOG_LEVEL);

struct can_rtl87x2g_mb_data {
	uint8_t idx;
	bool is_busy;
	int status;
	union {
		can_tx_callback_t tx_callback;
		can_rx_callback_t rx_callback;
	};
	void *user_data;
};

struct can_rtl87x2g_data {
	struct k_mutex inst_mutex;
	struct k_sem tx_int_sem;
	struct can_rtl87x2g_mb_data tx_mb_list[CONFIG_CAN_TX_MSG_BUF_NUM];
	struct can_rtl87x2g_mb_data rx_mb_list[CONFIG_CAN_RX_MSG_BUF_NUM];
	can_state_change_callback_t state_change_cb;
	void *state_change_cb_data;
	enum can_state state;
	bool started;
};

struct can_rtl87x2g_config {
	CAN_TypeDef *can; /*!< CAN Registers*/
	uint32_t bus_speed;
	uint16_t sample_point;
	uint8_t sjw;
	uint8_t prop_ts1;
	uint8_t ts2;
	uint16_t clkid;
	void (*config_irq)();
	const struct pinctrl_dev_config *pcfg;
	const struct device *phy;
	uint32_t max_bitrate;
};

static struct k_mutex filter_mutex;
#define CAN_BUS_ON_TIMEOUT (10 * (sys_clock_hw_cycles_per_sec() / MSEC_PER_SEC))

static int can_rtl87x2g_check_bus_on(CAN_TypeDef *can, k_timeout_t timeout)
{
	ARG_UNUSED(can);
	int64_t start_time;

	start_time = k_uptime_ticks();

	while (CAN_GetBusState() != CAN_BUS_STATE_ON) {
		if (!K_TIMEOUT_EQ(timeout, K_FOREVER) &&
		    k_uptime_ticks() - start_time >= timeout.ticks) {
			return -EAGAIN;
		}
	}

	return 0;
}

static void can_rtl87x2g_tx_complete(const struct device *dev, int mb_list_idx)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	can_tx_callback_t callback = data->tx_mb_list[mb_list_idx].tx_callback;

	if (data->tx_mb_list[mb_list_idx].is_busy) {
		data->tx_mb_list[mb_list_idx].is_busy = false;
		k_sem_give(&data->tx_int_sem);

		if (callback != NULL) {
			data->tx_mb_list[mb_list_idx].tx_callback = NULL;
			callback(dev, data->tx_mb_list[mb_list_idx].status,
				 data->tx_mb_list[mb_list_idx].user_data);
		}
		data->tx_mb_list[mb_list_idx].status = 0;
	}
}

static void can_rtl87x2g_rx_complete(const struct device *dev, int mb_list_idx)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	CANMsgBufInfo_TypeDef mb_info;
	CANDataFrameSel_TypeDef frame_type;
	can_rx_callback_t callback = NULL;
	struct can_frame frame;

	CAN_GetMsgBufInfo(data->rx_mb_list[mb_list_idx].idx, &mb_info);

	memset(frame.data, 0, 8);
	CAN_GetRamData(mb_info.data_length, frame.data);

	frame_type = CAN_CheckFrameType(mb_info.rtr_bit, mb_info.ide_bit);

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[CAN HANDLER] rx_mb_list[mb_list_idx].idx%d frame_type %d, frame_id = 0x%03x, "
		   "ext_frame_id = 0x%05x",
		   data->rx_mb_list[mb_list_idx].idx, frame_type, mb_info.standard_frame_id,
		   mb_info.extend_frame_id);

	for (uint8_t index = 0; index < mb_info.data_length; index++) {
		DBG_DIRECT("[CAN HANDLER] frame.data [%d] 0x%02x", index, frame.data[index]);
	}
#endif

	frame.dlc = mb_info.data_length;
	frame.flags = (mb_info.rtr_bit ? CAN_FRAME_RTR : 0) | (mb_info.ide_bit ? CAN_FRAME_IDE : 0);
	frame.id = mb_info.ide_bit ? ((mb_info.standard_frame_id << CAN_STD_FRAME_ID_POS) |
				      mb_info.extend_frame_id)
				   : mb_info.standard_frame_id;
	callback = data->rx_mb_list[mb_list_idx].rx_callback;
	if (callback) {
		callback(dev, &frame, data->rx_mb_list[mb_list_idx].user_data);
	}
}

static int can_rtl87x2g_get_capabilities(const struct device *dev, can_mode_t *cap)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	ARG_UNUSED(dev);
	ARG_UNUSED(cap);

	*cap = CAN_MODE_NORMAL | CAN_MODE_LISTENONLY;

	return 0;
}

static int can_rtl87x2g_start(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] dev %s", dev->name, __func__);
#endif
	const struct can_rtl87x2g_config *cfg = dev->config;
	struct can_rtl87x2g_data *data = dev->data;
	CAN_TypeDef *can = cfg->can;
	int ret = 0;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (data->started) {
		ret = -EALREADY;
		goto unlock;
	}

	if (cfg->phy != NULL) {
		ret = can_transceiver_enable(cfg->phy);
		if (ret != 0) {
			LOG_ERR("failed to enable CAN transceiver (err %d)", ret);
			goto unlock;
		}
	}

	CAN_Cmd(ENABLE);

	ret = can_rtl87x2g_check_bus_on(can, K_MSEC(10));
	if (ret < 0) {

		LOG_ERR("CAN bus off");

		CAN_Cmd(DISABLE);

		if (cfg->phy != NULL) {
			/* Attempt to disable the CAN transceiver in case of error */
			(void)can_transceiver_disable(cfg->phy);
		}

		ret = -EIO;
		goto unlock;
	}

	CAN_INTConfig((CAN_BUS_OFF_INT | CAN_ERROR_INT | CAN_RX_INT | CAN_TX_INT), ENABLE);

	data->started = true;

unlock:
	k_mutex_unlock(&data->inst_mutex);

	return ret;
}

static int can_rtl87x2g_stop(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] dev %s", dev->name, __func__);
#endif
	const struct can_rtl87x2g_config *cfg = dev->config;
	struct can_rtl87x2g_data *data = dev->data;
	int ret = 0;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (!data->started) {
		ret = -EALREADY;
		goto unlock;
	}

	CAN_INTConfig((CAN_BUS_OFF_INT | CAN_ERROR_INT | CAN_RX_INT | CAN_TX_INT), DISABLE);

	CAN_Cmd(DISABLE);

	if (cfg->phy != NULL) {
		ret = can_transceiver_disable(cfg->phy);
		if (ret != 0) {
			LOG_ERR("failed to enable CAN transceiver (err %d)", ret);
			goto unlock;
		}
	}

	data->started = false;

unlock:
	k_mutex_unlock(&data->inst_mutex);

	return ret;
}

static int can_rtl87x2g_set_mode(const struct device *dev, can_mode_t mode)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] dev %s mode 0x%x", __func__, dev->name, mode);
#endif
	struct can_rtl87x2g_data *data = dev->data;

