YuzhuoLiuRTK/zephyr/drivers/can/can_rtl87x2g.c
	LOG_DBG("Set mode %d", mode);

	if ((mode & ~(CAN_MODE_LOOPBACK | CAN_MODE_LISTENONLY | CAN_MODE_ONE_SHOT)) != 0) {
		LOG_ERR("unsupported mode: 0x%08x", mode);
		return -ENOTSUP;
	}

	if (data->started) {
		return -EBUSY;
	}

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if ((mode & CAN_MODE_LOOPBACK) != 0) {
		CAN_SetTestMode(CAN_TEST_MODE_INT_LOOPBACK);
	} else if ((mode & CAN_MODE_LISTENONLY) != 0) {
		CAN_SetTestMode(CAN_TEST_MODE_SILENCE);
	} else {
		CAN_SetTestMode(CAN_TEST_MODE_NONE);
	}

	if ((mode & CAN_MODE_ONE_SHOT) != 0) {
		/* No automatic retransmission */
		CAN_AutoReTxCmd(DISABLE);
	} else {
		CAN_AutoReTxCmd(ENABLE);
	}

	k_mutex_unlock(&data->inst_mutex);

	return 0;
}

static int can_rtl87x2g_set_timing(const struct device *dev, const struct can_timing *timing)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] dev %s", __func__, dev->name);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	CAN_BIT_TIMING_TYPE_TypeDef CAN_BitTiming;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (data->started) {
		k_mutex_unlock(&data->inst_mutex);
		return -EBUSY;
	}

	CAN_BitTiming.b.can_brp = timing->prescaler - 1;
	CAN_BitTiming.b.can_sjw = timing->sjw;
	CAN_BitTiming.b.can_tseg1 = timing->phase_seg1 - 1;
	CAN_BitTiming.b.can_tseg2 = timing->phase_seg2 - 1;

	CAN_SetTiming(&CAN_BitTiming);

	k_mutex_unlock(&data->inst_mutex);

	return 0;
}

static int can_rtl87x2g_requst_message_buffer(const struct device *dev, bool is_tx)
{
	struct can_rtl87x2g_data *data = dev->data;
	uint8_t mb_num;
	struct can_rtl87x2g_mb_data *mb_list;

	mb_num = is_tx ? CONFIG_CAN_TX_MSG_BUF_NUM : CONFIG_CAN_RX_MSG_BUF_NUM;
	mb_list = is_tx ? data->tx_mb_list : data->rx_mb_list;

	for (uint8_t i = 0; i < mb_num; i++) {
		if (!mb_list[i].is_busy) {
			return i;
		}
	}

	return -EAGAIN;
}

static int can_rtl87x2g_send(const struct device *dev, const struct can_frame *frame,
			     k_timeout_t timeout, can_tx_callback_t callback, void *user_data)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	CANTxFrame_TypeDef tx_frame_type;
	CANError_TypeDef tx_error;
	int mb_list_idx;
	int mb_idx;
	int ret;

	LOG_DBG("Sending %d bytes on %s. "
		"Id: 0x%x, "
		"ID type: %s, "
		"Remote Frame: %s",
		frame->dlc, dev->name, frame->id,
		(frame->flags & CAN_FRAME_IDE) != 0 ? "extended" : "standard",
		(frame->flags & CAN_FRAME_RTR) != 0 ? "yes" : "no");

	__ASSERT_NO_MSG(callback != NULL);
	__ASSERT(frame->dlc == 0U || frame->data != NULL, "Dataptr is null");

	if (frame->dlc > CAN_MAX_DLC) {
		LOG_ERR("DLC of %d exceeds maximum (%d)", frame->dlc, CAN_MAX_DLC);
		return -EINVAL;
	}

	if ((frame->flags & ~(CAN_FRAME_IDE | CAN_FRAME_RTR)) != 0) {
		LOG_ERR("Unsupported CAN frame flags 0x%02x", frame->flags);
		return -ENOTSUP;
	}

	if (!data->started) {
		LOG_ERR("CAN not start");
		return -ENETDOWN;
	}

	if (CAN_GetBusState() != CAN_BUS_STATE_ON) {
		LOG_ERR("CAN buss off");
		return -ENETUNREACH;
	}

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (k_sem_take(&data->tx_int_sem, timeout)) {
		k_mutex_unlock(&data->inst_mutex);
		LOG_ERR("Take CAN tx message buffer sem fail");
		return -EAGAIN;
	}

	ret = 0;
	mb_list_idx = can_rtl87x2g_requst_message_buffer(dev, true);
	if (mb_list_idx < 0) {
		ret = -EAGAIN;
		LOG_ERR("There is no free CAN tx message buffer");
		goto fail;
	}

	mb_idx = data->tx_mb_list[mb_list_idx].idx;

	if (frame->flags & CAN_FRAME_IDE) {
		if (frame->flags & CAN_FRAME_RTR) {
			tx_frame_type.frame_type = CAN_EXT_REMOTE_FRAME;
		} else {
			tx_frame_type.frame_type = CAN_EXT_DATA_FRAME;
		}
		tx_frame_type.standard_frame_id =
			(frame->id >> CAN_STD_FRAME_ID_POS) & CAN_STAND_FRAME_ID_MAX_VALUE;
		tx_frame_type.extend_frame_id = frame->id & CAN_EXTEND_FRAME_ID_MAX_VALUE;
	} else {
		if (frame->flags & CAN_FRAME_RTR) {
			tx_frame_type.frame_type = CAN_STD_REMOTE_FRAME;
		} else {
			tx_frame_type.frame_type = CAN_STD_DATA_FRAME;
		}
		tx_frame_type.standard_frame_id = frame->id & CAN_STAND_FRAME_ID_MAX_VALUE;
		tx_frame_type.extend_frame_id = 0;
	}

	tx_frame_type.msg_buf_id = mb_idx;

	tx_frame_type.auto_reply_bit = DISABLE;

	tx_error = CAN_SetMsgBufTxMode(&tx_frame_type, frame->data, frame->dlc);

	while (CAN_GetRamState() != CAN_RAM_STATE_IDLE) {
		__asm volatile("nop    \n");
	}

	if (tx_error != CAN_NO_ERR) {
		ret = -EINVAL;
		goto fail;
	}

	data->tx_mb_list[mb_list_idx].tx_callback = callback;
	data->tx_mb_list[mb_list_idx].user_data = user_data;
	data->tx_mb_list[mb_list_idx].is_busy = true;

	CAN_MBTxINTConfig(tx_frame_type.msg_buf_id, ENABLE);

fail:
	if (ret < 0) {
		LOG_ERR("CAN send fail ret%d", ret);
		k_sem_give(&data->tx_int_sem);
	}

	k_mutex_unlock(&data->inst_mutex);

	return ret;
}

static int can_rtl87x2g_add_rx_filter(const struct device *dev, can_rx_callback_t callback,
				      void *user_data, const struct can_filter *filter)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] filter->id=0x%x, filter->flags=0x%x, filter->mask=0x%x", __func__,
		   filter->id, filter->flags, filter->mask);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	CANRxFrame_TypeDef rx_frame_type;
	CANError_TypeDef rx_error;
	int mb_list_idx;

	if ((filter->flags & ~(CAN_FILTER_IDE | CAN_FILTER_DATA | CAN_FILTER_RTR)) != 0) {
		LOG_ERR("Unsupported CAN filter flags 0x%02x", filter->flags);
		return -ENOTSUP;
	}

	if ((filter->flags & (CAN_FILTER_DATA | CAN_FILTER_RTR)) == 0) {
		LOG_ERR("DATA or RTR frames should be filtered 0x%02x", filter->flags);
		return -ENOTSUP;
	}

	k_mutex_lock(&filter_mutex, K_FOREVER);
	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	mb_list_idx = can_rtl87x2g_requst_message_buffer(dev, false);
	if (mb_list_idx < 0) {
		mb_list_idx = -ENOSPC;
		LOG_ERR("There is no free CAN rx filters");
		goto unlock;
	}

	rx_frame_type.msg_buf_id = data->rx_mb_list[mb_list_idx].idx;

	rx_frame_type.frame_ide_mask = 0;
	rx_frame_type.frame_ide_bit = (filter->flags & CAN_FILTER_IDE) ? 1 : 0;

	rx_frame_type.frame_rtr_mask = ((filter->flags & (CAN_FILTER_RTR | CAN_FILTER_DATA)) ==
					(CAN_FILTER_RTR | CAN_FILTER_DATA))
					       ? 1
					       : 0;
	rx_frame_type.frame_rtr_bit = (filter->flags & CAN_FILTER_DATA) ? 0 : 1;

