YuzhuoLiuRTK/zephyr/drivers/can/can_rtl87x2g.c
	if (rx_frame_type.frame_ide_bit) {
		rx_frame_type.standard_frame_id =
			(filter->id >> CAN_STD_FRAME_ID_POS) & CAN_STAND_FRAME_ID_MAX_VALUE;
		rx_frame_type.extend_frame_id = filter->id & CAN_EXTEND_FRAME_ID_MAX_VALUE;
		rx_frame_type.frame_id_mask = ~(filter->mask & CAN_FRAME_ID_MASK_MAX_VALUE);
	} else {
		rx_frame_type.standard_frame_id = filter->id & CAN_STAND_FRAME_ID_MAX_VALUE;
		rx_frame_type.extend_frame_id = 0;
		rx_frame_type.frame_id_mask =
			~((filter->mask & CAN_STAND_FRAME_ID_MAX_VALUE) << CAN_STD_FRAME_ID_POS);
	}

	rx_frame_type.rx_dma_en = false;
	rx_frame_type.auto_reply_bit = false;
	rx_frame_type.rx_msg_buf_enable = true;

	rx_error = CAN_SetMsgBufRxMode(&rx_frame_type);

	while (CAN_GetRamState() != CAN_RAM_STATE_IDLE) {
		__asm volatile("nop    \n");
	}

	if (rx_error != CAN_NO_ERR) {
		mb_list_idx = -ENOSPC;
		goto unlock;
	}

	data->rx_mb_list[mb_list_idx].rx_callback = callback;
	data->rx_mb_list[mb_list_idx].user_data = user_data;
	data->rx_mb_list[mb_list_idx].is_busy = true;

	CAN_MBRxINTConfig(rx_frame_type.msg_buf_id, ENABLE);

unlock:
	k_mutex_unlock(&data->inst_mutex);
	k_mutex_unlock(&filter_mutex);

	return mb_list_idx;
}

static void can_rtl87x2g_remove_rx_filter(const struct device *dev, int mb_list_idx)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	CANRxFrame_TypeDef rx_frame_type;

	k_mutex_lock(&filter_mutex, K_FOREVER);
	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	rx_frame_type.msg_buf_id = data->rx_mb_list[mb_list_idx].idx;
	rx_frame_type.rx_msg_buf_enable = false;
	CAN_SetMsgBufRxMode(&rx_frame_type);

	CAN_MBRxINTConfig(data->rx_mb_list[mb_list_idx].idx, DISABLE);

	while (CAN_GetRamState() != CAN_RAM_STATE_IDLE) {
		__asm volatile("nop    \n");
	}

	data->rx_mb_list[mb_list_idx].rx_callback = NULL;
	data->rx_mb_list[mb_list_idx].user_data = NULL;
	data->rx_mb_list[mb_list_idx].is_busy = false;

	k_mutex_unlock(&data->inst_mutex);
	k_mutex_unlock(&filter_mutex);
}

static int can_rtl87x2g_get_state(const struct device *dev, enum can_state *state,
				  struct can_bus_err_cnt *err_cnt)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;

	if (state != NULL) {
		if (!data->started) {
			*state = CAN_STATE_STOPPED;
		} else if (CAN_GetBusState() != CAN_BUS_STATE_ON) {
			*state = CAN_STATE_BUS_OFF;
		} else if (CAN_GetErrorPassiveStatus()) {
			*state = CAN_STATE_ERROR_PASSIVE;
		} else if (CAN_GetErrorWarningStatus()) {
			*state = CAN_STATE_ERROR_WARNING;
		} else {
			*state = CAN_STATE_ERROR_ACTIVE;
		}
	}

	if (err_cnt != NULL) {
		err_cnt->tx_err_cnt = CAN_GetTxErrorCnt();
		err_cnt->rx_err_cnt = CAN_GetRxErrorCnt();
	}

	return 0;
}

#ifndef CONFIG_CAN_AUTO_BUS_OFF_RECOVERY
static int can_rtl87x2g_recover(const struct device *dev, k_timeout_t timeout)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct can_rtl87x2g_config *cfg = dev->config;
	struct can_rtl87x2g_data *data = dev->data;
	int ret = -EAGAIN;
	int64_t start_time;

	if (!data->started) {
		return -ENETDOWN;
	}

	if (CAN_GetBusState() == CAN_BUS_STATE_ON) {
		return 0;
	}

	if (k_mutex_lock(&data->inst_mutex, K_FOREVER)) {
		return -EAGAIN;
	}

	CAM_Cmd(DISABLE);

	CAM_Cmd(ENABLE);

	ret = can_rtl87x2g_check_bus_on(can, timeout);

	k_mutex_unlock(&data->inst_mutex);

	return ret;
}
#endif /* CONFIG_CAN_AUTO_BUS_OFF_RECOVERY */

static void can_rtl87x2g_set_state_change_callback(const struct device *dev,
						   can_state_change_callback_t cb, void *user_data)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;

	data->state_change_cb = cb;
	data->state_change_cb_data = user_data;

	if (cb == NULL) {
		CAN_INTConfig((CAN_BUS_OFF_INT | CAN_ERROR_INT | CAN_RX_INT | CAN_TX_INT), DISABLE);
	} else {
		CAN_INTConfig((CAN_BUS_OFF_INT | CAN_ERROR_INT | CAN_RX_INT | CAN_TX_INT), ENABLE);
	}
}

static int can_rtl87x2g_get_core_clock(const struct device *dev, uint32_t *rate)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	ARG_UNUSED(dev);

	*rate = 40000000;

	return 0;
}

static int can_rtl87x2g_get_max_bitrate(const struct device *dev, uint32_t *max_bitrate)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct can_rtl87x2g_config *config = dev->config;

	*max_bitrate = config->max_bitrate;

	return 0;
}

static int can_rtl87x2g_get_max_filters(const struct device *dev, bool ide)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	ARG_UNUSED(dev);
	ARG_UNUSED(ide);

	if (ide) {
		return CONFIG_CAN_MAX_EXT_ID_FILTER;
	} else {
		return CONFIG_CAN_MAX_STD_ID_FILTER;
	}
}

static inline void can_rtl87x2g_isr(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct can_rtl87x2g_data *data = dev->data;
	struct can_bus_err_cnt err_cnt;
	enum can_state state;
	const can_state_change_callback_t cb = data->state_change_cb;
	void *state_change_cb_data = data->state_change_cb_data;

	if (SET == CAN_GetINTStatus(CAN_BUS_OFF_INT_FLAG)) {
		CAN_ClearINTPendingBit(CAN_BUS_OFF_INT_FLAG);
		for (uint8_t mb_list_idx = 0; mb_list_idx < CONFIG_CAN_TX_MSG_BUF_NUM;
		     mb_list_idx++) {
			data->tx_mb_list[mb_list_idx].status = -ENETUNREACH;
			can_rtl87x2g_tx_complete(dev, mb_list_idx);
		}
	}

	if (SET == CAN_GetINTStatus(CAN_ERROR_INT_FLAG)) {
		CAN_ClearINTPendingBit(CAN_ERROR_INT_FLAG);

		if (SET == CAN_GetErrorStatus(CAN_ERROR_RX)) {
			CAN_CLearErrorStatus(CAN_ERROR_RX);
		}

		if (SET == CAN_GetErrorStatus(CAN_ERROR_TX)) {
			CAN_CLearErrorStatus(CAN_ERROR_TX);
			for (uint8_t mb_list_idx = 0; mb_list_idx < CONFIG_CAN_TX_MSG_BUF_NUM;
			     mb_list_idx++) {
				if (SET ==
				    CAN_GetMBnTxErrorFlag(data->tx_mb_list[mb_list_idx].idx)) {
					CAN_ClearMBnTxErrorFlag(data->tx_mb_list[mb_list_idx].idx);
					data->tx_mb_list[mb_list_idx].status = -EIO;
					can_rtl87x2g_tx_complete(dev, mb_list_idx);
				}
			}
		}

#ifdef CONFIG_CAN_STATS
		if (SET == CAN_GetErrorStatus(CAN_ERROR_ACK)) {
			CAN_CLearErrorStatus(CAN_ERROR_ACK);
			CAN_STATS_ACK_ERROR_INC(dev);
		}

		if (SET == CAN_GetErrorStatus(CAN_ERROR_STUFF)) {
			CAN_CLearErrorStatus(CAN_ERROR_STUFF);
			CAN_STATS_STUFF_ERROR_INC(dev);
		}

