YuzhuoLiuRTK/zephyr/drivers/can/can_rtl87x2g.c
		if (SET == CAN_GetErrorStatus(CAN_ERROR_CRC)) {
			CAN_CLearErrorStatus(CAN_ERROR_CRC);
			CAN_STATS_CRC_ERROR_INC(dev);
		}

		if (SET == CAN_GetErrorStatus(CAN_ERROR_FORM)) {
			CAN_CLearErrorStatus(CAN_ERROR_FORM);
			CAN_STATS_FORM_ERROR_INC(dev);
		}

		if (SET == CAN_GetErrorStatus(CAN_ERROR_BIT1)) {
			CAN_CLearErrorStatus(CAN_ERROR_BIT1);
			CAN_STATS_BIT1_ERROR_INC(dev);
		}

		if (SET == CAN_GetErrorStatus(CAN_ERROR_BIT0)) {
			CAN_CLearErrorStatus(CAN_ERROR_BIT0);
			CAN_STATS_BIT0_ERROR_INC(dev);
		}
#endif /* CONFIG_CAN_STATS */

		(void)can_rtl87x2g_get_state(dev, &state, &err_cnt);

		if (state != data->state) {
			data->state = state;

			if (cb != NULL) {
				cb(dev, state, err_cnt, state_change_cb_data);
			}
		}
	}

	if (SET == CAN_GetINTStatus(CAN_RX_INT_FLAG)) {
		CAN_ClearINTPendingBit(CAN_RX_INT_FLAG);
		for (uint8_t mb_list_idx = 0; mb_list_idx < CONFIG_CAN_RX_MSG_BUF_NUM;
		     mb_list_idx++) {
			if (SET == CAN_GetMBnRxDoneFlag(data->rx_mb_list[mb_list_idx].idx)) {
				CAN_ClearMBnRxDoneFlag(data->rx_mb_list[mb_list_idx].idx);
				can_rtl87x2g_rx_complete(dev, mb_list_idx);
			}
		}
	}

	if (SET == CAN_GetINTStatus(CAN_TX_INT_FLAG)) {
		CAN_ClearINTPendingBit(CAN_TX_INT_FLAG);
		for (uint8_t mb_list_idx = 0; mb_list_idx < CONFIG_CAN_TX_MSG_BUF_NUM;
		     mb_list_idx++) {
			if (SET == CAN_GetMBnTxDoneFlag(data->tx_mb_list[mb_list_idx].idx)) {
				CAN_ClearMBnTxDoneFlag(data->tx_mb_list[mb_list_idx].idx);
				can_rtl87x2g_tx_complete(dev, mb_list_idx);
			}
		}
	}
}

static const struct can_driver_api can_rtl87x2g_driver_api = {
	.get_capabilities = can_rtl87x2g_get_capabilities,
	.start = can_rtl87x2g_start,
	.stop = can_rtl87x2g_stop,
	.set_mode = can_rtl87x2g_set_mode,
	.set_timing = can_rtl87x2g_set_timing,
	.send = can_rtl87x2g_send,
	.add_rx_filter = can_rtl87x2g_add_rx_filter,
	.remove_rx_filter = can_rtl87x2g_remove_rx_filter,
	.get_state = can_rtl87x2g_get_state,
#ifndef CONFIG_CAN_AUTO_BUS_OFF_RECOVERY
	.recover = can_rtl87x2g_recover,
#endif
	.set_state_change_callback = can_rtl87x2g_set_state_change_callback,
	.get_core_clock = can_rtl87x2g_get_core_clock,
	.get_max_bitrate = can_rtl87x2g_get_max_bitrate,
	.get_max_filters = can_rtl87x2g_get_max_filters,
	.timing_min = {.sjw = 0x1,
		       .prop_seg = 0x00,
		       .phase_seg1 = 0x01,
		       .phase_seg2 = 0x01,
		       .prescaler = 0x01},
	.timing_max = {.sjw = 0x08,
		       .prop_seg = 0x00,
		       .phase_seg1 = 0x100,
		       .phase_seg2 = 0x100,
		       .prescaler = 0x100}};

static int can_rtl87x2g_init(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct can_rtl87x2g_config *cfg = dev->config;
	struct can_rtl87x2g_data *data = dev->data;
	struct can_timing timing = {0};
	int ret;
	CAN_InitTypeDef init_struct;

	k_mutex_init(&filter_mutex);
	k_mutex_init(&data->inst_mutex);
	k_sem_init(&data->tx_int_sem, CONFIG_CAN_TX_MSG_BUF_NUM, CONFIG_CAN_TX_MSG_BUF_NUM);

	for (uint8_t i = 0; i < CONFIG_CAN_TX_MSG_BUF_NUM; i++) {
		data->tx_mb_list[i].idx = i;
		data->tx_mb_list[i].is_busy = 0;
		data->tx_mb_list[i].status = 0;
		data->tx_mb_list[i].tx_callback = 0;
		data->tx_mb_list[i].user_data = 0;
	}

	for (uint8_t i = 0; i < CONFIG_CAN_RX_MSG_BUF_NUM; i++) {
		data->rx_mb_list[i].idx = i + CONFIG_CAN_TX_MSG_BUF_NUM;
		data->rx_mb_list[i].is_busy = 0;
		data->rx_mb_list[i].status = 0;
		data->rx_mb_list[i].rx_callback = 0;
		data->rx_mb_list[i].user_data = 0;
	}

	if (cfg->phy != NULL) {
		if (!device_is_ready(cfg->phy)) {
			LOG_ERR("CAN transceiver not ready");
			return -ENODEV;
		}
	}

	(void)clock_control_on(RTL87X2G_CLOCK_CONTROLLER, (clock_control_subsys_t)&cfg->clkid);

	/* Configure pinmux  */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	/* Configure peripheral  */

	if (cfg->sample_point) {
		ret = can_calc_timing(dev, &timing, cfg->bus_speed, cfg->sample_point);
		if (ret == -EINVAL) {
			LOG_ERR("Can't find timing for given param");
			return -EIO;
		}
		LOG_DBG("Presc: %d, SJW: %d, TS1: %d, TS2: %d", timing.prescaler, timing.sjw,
			timing.phase_seg1, timing.phase_seg2);
		LOG_DBG("Sample-point err : %d", ret);
	} else {
		timing.sjw = cfg->sjw;
		timing.prop_seg = 0;
		timing.phase_seg1 = cfg->prop_ts1;
		timing.phase_seg2 = cfg->ts2;
		ret = can_calc_prescaler(dev, &timing, cfg->bus_speed);
		if (ret) {
			LOG_WRN("Bitrate error: %d", ret);
			return ret;
		}
	}

	/* Initialize CAN. */

	CAN_StructInit(&init_struct);

	init_struct.CAN_AutoReTxEn = ENABLE;
	init_struct.CAN_ErrorWarnThd = 128;

#if CONFIG_CAN_RX_TIMESTAMP
	init_struct.CAN_TimeStamp.b.can_time_stamp_en = ENABLE;
	init_struct.CAN_TimeStamp.b.can_time_stamp_div = 200;
#endif

	/* br = (core_clock / prescaler) / (1 + prop_seg + phase_seg1 + phase_seg2) */
	/* can speed = 40mhz / ((brp + 1)*(1 + tseg1 + 1 + tseg2 + 1)) */

	init_struct.CAN_BitTiming.b.can_brp = timing.prescaler - 1;
	init_struct.CAN_BitTiming.b.can_sjw = timing.sjw;
	init_struct.CAN_BitTiming.b.can_tseg1 = timing.phase_seg1 - 1;
	init_struct.CAN_BitTiming.b.can_tseg2 = timing.phase_seg2 - 1;

	CAN_Init(&init_struct);

	ret = can_set_timing(dev, &timing);
	if (ret) {
		LOG_WRN("Set timing error: %d", ret);
		return ret;
	}

	cfg->config_irq();

	return 0;
}

#define CAN_RTL87X2G_IRQ_INST(index)                                                               \
	static void config_can_##index##_irq()                                                     \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), can_rtl87x2g_isr,   \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

#define CAN_RTL87X2G_CONFIG_INST(index)                                                            \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
	static const struct can_rtl87x2g_config can_rtl87x2g_cfg_##index = {                       \
		.can = (CAN_TypeDef *)DT_INST_REG_ADDR(index),                                     \
		.bus_speed = DT_INST_PROP(index, bus_speed),                                       \
		.sample_point = DT_INST_PROP_OR(index, sample_point, 0),                           \
		.sjw = DT_INST_PROP_OR(index, sjw, 1),                                             \
		.prop_ts1 = DT_INST_PROP_OR(index, prop_seg, 0) +                                  \
			    DT_INST_PROP_OR(index, phase_seg1, 0),                                 \
		.ts2 = DT_INST_PROP_OR(index, phase_seg2, 0),                                      \
		.clkid = DT_INST_CLOCKS_CELL(index, id),                                           \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                     \
		.config_irq = config_can_##index##_irq,                                            \
		.phy = DEVICE_DT_GET_OR_NULL(DT_INST_PHANDLE(index, phys)),                        \
		.max_bitrate = DT_INST_CAN_TRANSCEIVER_MAX_BITRATE(index, 1000000),                \
	};

#define CAN_RTL87X2G_DATA_INST(index) static struct can_rtl87x2g_data can_rtl87x2g_dev_data_##index;

#define CAN_RTL87X2G_DEFINE_INST(index)                                                            \
	CAN_DEVICE_DT_INST_DEFINE(index, can_rtl87x2g_init, NULL, &can_rtl87x2g_dev_data_##index,  \
				  &can_rtl87x2g_cfg_##index, POST_KERNEL,                          \
				  CONFIG_CAN_INIT_PRIORITY, &can_rtl87x2g_driver_api);

#define RTL87X2G_CAN_INIT(index)                                                                   \
	CAN_RTL87X2G_IRQ_INST(index)                                                               \
	CAN_RTL87X2G_CONFIG_INST(index)                                                            \
	CAN_RTL87X2G_DATA_INST(index)                                                              \
	CAN_RTL87X2G_DEFINE_INST(index)

DT_INST_FOREACH_STATUS_OKAY(RTL87X2G_CAN_INIT)
